[
    {
        "id":1,
        "name":"Web 3 & solidity",
        "Description":"Web3 & Solidity with React: Dive into Ethereum blockchain development using Web3.js, Solidity, and React. Build DApps, connect React apps with smart contracts, and write secure and efficient code. Explore the decentralized web's potential. Prerequisite: JavaScript and React knowledge.",
        "slogan":"Unleash the Power of Web3: Elevate Your Skills in just 45 days with Hands-On Mastery and Pioneer the Future of the Internet!",
        "tags":["web3","solidity"],
        "link":"/courses/blockchain",
        "agenda": [
            "Day 1: Introduction to Blockchain: Overview, history, and key concepts",
            "Day 2: Blockchain Architecture: Distributed ledger, blocks, and consensus mechanisms",
            "Day 3: Cryptography: Basics of encryption, hashing, and digital signatures",
            "Day 4: Blockchain Types: Public, private, and consortium blockchains",
            "Day 5: Bitcoin and Blockchain: Understanding the relationship and mining process",
            "Day 6: Smart Contracts: Introduction and use cases",
            "Day 7: Ethereum: Introduction to the Ethereum blockchain platform",
            "Day 8: Solidity: Basics of Ethereum's smart contract programming language",
            "Day 9: Solidity Hands-On: Writing and deploying a simple smart contract",
            "Day 10: Introduction to React.js: Basics of web development with React.js",
            "Day 11: Building a Front-End UI with React.js",
            "Day 12: Integrating a Smart Contract with React.js",
            "Day 13: Blockchain Security: Threats and vulnerabilities",
            "Day 14: Best Practices: Secure coding and auditing smart contracts",
            "Day 15: Blockchain Scalability: Challenges and potential solutions",
            "Day 16: Blockchain Interoperability: Cross-chain communication and atomic swaps",
            "Day 17: Privacy and Confidentiality on the Blockchain",
            "Day 18: Blockchain Governance: On-chain and off-chain decision-making",
            "Day 19: Regulatory and Legal Considerations",
            "Day 20: Blockchain Use Cases: Finance, supply chain, healthcare, and more",
            "Day 21: Solidity Advanced Concepts: Inheritance, modifiers, and events",
            "Day 22: React.js Advanced Concepts: State management and hooks",
            "Day 23: Building a DApp: Combining Solidity and React.js",
            "Day 24: Testing and Debugging Smart Contracts",
            "Day 25: Review and Q&A Session",
            "Day 26-30 :Mentorship: Interact with experienced blockchain professionals for guidance and insights.",
            "Day 31-40 :Project Completion: Allocate time for participants to work on their own blockchain-based projects. Mentors can provide support and feedback during this period."
        ],
        "image":"../assets/ethimg1.jpg"
    }
]